         01 DCLPROJECT330.                                                
             10 HENO                 PIC X(5).                            
             10 HPNO                 PIC X(5).                            
             10 HENAME               PIC X(8).                            
             10 HSALARY              PIC S9(5)V9(2) USAGE COMP-3.         
