         01 DCLPROJECT340.                                                
             10 HUSER                PIC X(5).                            
             10 HPASS                PIC X(8).                            
                   
