        01 WS-REC1.                                                      
             02 WS-PNO1              PIC X(5).                            
             02 WS-FILLER            PIC X(2).                            
             02 WS-PNAME1            PIC X(10).                            
             02 WS-FILLER            PIC X(2).                            
             02 WS-MNAME1            PIC X(7).
             02 WS-FILLER            PIC X(2).
             02 WS-PCOST1            PIC S9(7)V9(2) USAGE COMP-3.                
             02 WS-FILLER            PIC X(41).  